%将SPSS中得出的贡献率结合主成分含量求出各成分所占的比重
clear all
clc
%以下输入的数据来源于SPSS中的输出报告
%首先求酿酒红葡萄的
yshgxl=[0.22961 0.16892 0.12931 0.09705 0.06871 0.05674 0.04454 0.03839];
hzgxl=sum(yshgxl);
clhhqz=yshgxl/hzgxl;
%给出降维后各主成分中理化指标的权重，其中红葡萄降维后为8维，理化指标有30个
hw=zeros(8,30);

hw(1,2)=0.701;hw(1,4)=0.896;hw(1,5)=0.521;hw(1,9)=0.515;hw(1,10)=0.804;hw(1,11)=0.872;
hw(1,12)=0.754;hw(1,13)=0.777;hw(1,15)=0.631;hw(1,25)=0.597;hw(1,26)=0.51;
hw(2,1)=0.596;hw(2,16)=0.8;hw(2,17)=0.762;hw(2,18)=0.762;hw(2,22)=0.881;hw(2,23)=-0.507;
hw(3,14)=0.816;hw(3,20)=-0.63;hw(3,27)=-0.605;hw(3,29)=0.712;hw(3,30)=0.569;
hw(4,6)=0.629;hw(4,8)=0.641;hw(4,9)=0.736;hw(4,19)=-0.737;
hw(5,3)=-0.545;hw(5,21)=0.534;hw(5,23)=0.609;
hw(6,30)=0.514;
%以下求红葡萄最终权重中各个理化指标的比重
for i=1:30
    hlhqz(i)=0;
    for j=1:8
       hlhqz(i)=hlhqz(i)+clhhqz(j)*hw(j,i);
    end
end
disp('红葡萄降维分析后原来理化指标占相应的权重应该为：')
hlhqz
%求酿酒白葡萄的
ysbgxl=[0.18993 0.17569 0.11838 0.07251 0.06356 0.05415 0.05122 0.04568 0.03971 0.03541];
bzgxl=sum(ysbgxl);
clhbqz=ysbgxl/bzgxl;
%给出降维后各主成分中理化指标的权重，其中白葡萄降维后为10维，理化指标有30个
bw=zeros(10,30);

bw(1,1)=0.509;bw(1,16)=0.769;bw(1,17)=0.687;bw(1,18)=0.843;bw(1,22)=0.81;bw(1,23)=0.669;
bw(1,24)=-0.539;bw(1,26)=-0.555;bw(1,28)=0.53;bw(1,30)=0.72;
bw(2,2)=0.675;bw(2,8)=-0.507;bw(2,11)=0.799;bw(2,13)=0.796;bw(2,20)=0.591;bw(2,21)=-0.569;
bw(2,24)=0.513;
bw(3,3)=-0.562;bw(3,20)=-0.55;bw(3,21)=0.642;bw(3,28)=-0.513;bw(3,29)=0.552;bw(3,30)=-0.534;
bw(4,9)=0.604;bw(4,15)=0.517;
bw(5,5)=0.587;bw(5,6)=0.672;bw(5,23)=0.609;
bw(7,14)=0.796;
%以下求红葡萄最终权重中各个理化指标的比重
for i=1:30
    blhqz(i)=0;
    for j=1:10
       blhqz(i)=blhqz(i)+clhbqz(j)*bw(j,i);
    end
end
disp('白葡萄降维分析后原来理化指标占相应的权重应该为：')
blhqz
%判断两种酿酒葡萄各理化指标是否具有一定的显著性差异
%如果数据可靠，保存以上权重
[g,h]=ranksum(hlhqz,blhqz,0.05);
if h==0
    disp('    两者酿酒葡萄各理化指标所占权重具有没有显著性差异，数据可靠')
    save lhzbqzfile hlhqz blhqz
else
    disp('    两者酿酒葡萄各理化指标所占权重具有有显著性差异，需要重新审核数据')
end