clc;
clear;

% Φ -> A   纬度
% δ -> F   太阳赤道纬度夹角
% ω -> C   太阳时角
%  h -> Oh  太阳高度角
% λ -> D   经度
%

% 10月22日北京时间9:00-15:00

% 10月22日是一年的第 295 天
n = 295.0;




%地理位置 北纬39度54分26秒,东经116度23分29秒
% 纬度
A = 39 + 54/60 + 26/3600;
% 经度
D = 116 + 23/60 + 29/3600;
% 时区经度
Dm = 120;






LArr = [1 2 3 4 5 6 7 8 9 10 11 12];
JArr = [70 75 80 85 90 95 100 105 110 115 120 125 135 140 145 150 155 160 165 170 175];
WArr = [15 20 25 30 35 40 45 50 55 60 65 70];
DateArr = [1 32 60 91 121 152 182 213 244 274 305 335];
R = [1.1 2.1 3.1 4.1 5.1 6.1 7.1 8.1 9.1 10.1 11.1 12.1]
LsArr = [];


m = 11;
nn = 30;

% T0： m 时 n 分  
% 9:00-15:00
% m = [9, 15]  n = [0, 59]
for i = 1:21
    % 太阳赤纬夹角（度）
    F = 23.45*sin(2*pi*(284+n)/365);

    % 太阳时
    B = 2*pi*(n -81)/364;
    E = 9.87*sin(2*B) - 7.53*cos(B) - 1.5*sin(B); 
        
    D = JArr(i);
    %A = WArr(i);
    T0 = m + nn/60;
    Ts = T0 + E/60 + (D - Dm)/15;
    % 太阳时角（度）
    C = 15*(Ts - 12);


    % 太阳高度角
    Oh = asin(sin(A*pi/180)*sin(F*pi/180) + cos(A*pi/180)*cos(F*pi/180)*cos(C*pi/180));

    Ohh = Oh*180/pi;



    % 杆长 L = 3 m
    L = 3;

    % 影长 Ls
    Ls = L/tan(Oh);
    LsArr(i) = Ls;

end




plot(JArr, LsArr);
%axis([1 12 0 7]);
xlabel('经度（°E）');
ylabel('影长（米）');
title('不同经度与影长关系曲线');





