clc;
clear;

% Φ -> A   纬度
% δ -> F   太阳赤道纬度夹角
% ω -> C   太阳时角
%  h -> Oh  太阳高度角
% λ -> D   经度
%

% 时间
hour = [14	14	14	14	14	14	15	15	15	15	15	15	15	15	15	15	15	15	15	15	15];
minutes = [42	45	48	51	54	57	0	3	6	9	12	15	18	21	24	27	30	33	36	39	42];

dLs = [1.1496 	1.1822 	1.2153 	1.2491 	1.2832 	1.3180 	1.3534 	1.3894 	1.4262 	1.4634 	1.5015 	1.5402 	1.5799 	1.6201 	1.6613 	1.7033 	1.7462 	1.7901 	1.8350 	1.8809 	1.9279 ];


LArr = [1.6	1.7	1.7	1.8	2	2	2	2.2	2.2	2.4	2.6	2.7];
JArr = [115	114	114	111	107	109	109	104	106	100	100	99];
WArr = [5	10	11	2	-1	19	20	-2	21	-5	24	24];

% 4月18日是一年的第 108 天
n = 108;

ii = 11;


%地理位置 北纬39度54分26秒,东经116度23分29秒
% 杆长 L = 3 m
L = LArr(ii);
% 经度
J = JArr(ii);
% 纬度
W = WArr(ii);
% 时区经度
Jm = 120;

% 太阳赤纬夹角（度）
C = 23.45*sin(2*pi*(284+n)/365);

% 太阳时
B = 2*pi*(n -81)/364;
E = 9.87*sin(2*B) - 7.53*cos(B) - 1.5*sin(B); 


X = [];


% T0： m 时 n 分  
% 9:00-15:00
% m = [9, 15]  n = [0, 59]
for i=1:1:21
    
    
        
    T0 = hour(i) + minutes(i)/60;
    Ts = T0 + E/60 + (J - Jm)/15;
    
    
    % 太阳时角（度）
    S = 15*(Ts - 12);

    X(i) = T0;


    % 太阳高度角
    Oh = asin(sin(W*pi/180)*sin(C.*pi/180) + cos(W*pi/180)*cos(C*pi/180)*cos(S*pi/180));


    

    % 影长 Ls
    Ls = L/tan(Oh);
    LsArr(i) = Ls;
end


plot(X, dLs, '*');
hold on;
plot(X, LsArr, 'm');
%axis([9 15 22 40]);

xlabel('时间');
ylabel('影子长度');
title('(21°N, 106°E)');
legend('实际值' ,'预测曲线');





